app/controllers/subscriptions_controller.rb

  def new
    plan = Plan.find(params[:plan_id])
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 2 LIMIT 1

  def create
    @subscription = Subscription.new(params[:subscription])
    abort @subscription.to_yaml
    if @subscription.save_with_payment
---
INSERT INTO `subscriptions` (`created_at`, `email`, `paypal_customer_token`, `paypal_recurring_profile_token`, `plan_id`, `stripe_customer_token`, `updated_at`) VALUES ('2014-10-25 10:52:20', 'souravbhadani94@gmail.com', 'FEPYSRZJCANNE', 'I-WNXS1VYRYPTC', 2, NULL, '2014-10-25 10:52:20')

  def show
    @subscription = Subscription.find(params[:id])
---
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`id` = 1 LIMIT 1

  def paypal_checkout
    plan = Plan.find(params[:plan_id])
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 1 LIMIT 1